<!DOCTYPE html>
<html lang="en">
<head>
<title>Water on Graphene</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="stylesheet.css">

</head>
<body onload="init()">

<div class="topnav">
  <a href="index.html">Home</a>
  <a href="blog/index.html">Blog</a>
  <div class="dropdown">
    <button class="dropbtn">Reviews <i>&#x25bc;</i> </button>
    <div class="dropdown-content">
      <a href="books.html">Book reviews</a>
      <a href="moocs.html">MOOC reviews</a>
    </div>
  </div>
  <div class="dropdown">
    <button class="dropbtn">Webapps <i>&#x25bc;</i> </button>
    <div class="dropdown-content">
      <a href="https://www.zetaprose.com" target="_blank">NLP fiction analysis tool</a>
      <a href="steno/index.html">Stenographic handwriting recognition</a>
      <a href="weatherapp/index.html">Climate comparison tool</a>
    </div>
  </div>
  <div class="dropdown">
    <button class="dropbtn">Fun <i>&#x25bc;</i> </button>
    <div class="dropdown-content">
      <a href="food-frenzy/index.html">Food Frenzy</a>
      <a href="motus/index.html">Motus (word game)</a>
      <a href="fish/index.html">Fish (card game)</a>
    </div>
  </div>
</div>

<div class="content">
  <h2>Book reviews</h2>

<!--<h5>Elements of Statistical Learning by Hastie, Tibshirani, and Friedman</h5>

<h5>Apprentissage Statistique - Dreyfus</h5>
-->

<div class="bookreview textcard clearfix">
<h3><a href="https://www.deeplearningbook.org/">Deep Learning</a> by Ian Goodfellow, Yoshua Bengio, and Aaron Courville</h3>
<img src="images/bookcover_deeplearning.jpg" class="bookcover">
<!--<img src="https://mitpress.mit.edu/sites/default/files/styles/large_book_cover/http/mitp-content-server.mit.edu%3A18180/books/covers/cover/%3Fcollid%3Dbooks_covers_0%26isbn%3D9780262035613%26type%3D.jpg?itok=opJUfdCT" class="bookcover">-->
<h4>(Intermediate to Advanced)</h4>


<p>Best read AFTER having briefly studied the topics using other introductory texts, since this book goes into much more detail than introductory texts. That's particularly true for Part III (autoencoders, deep generative models and so on).</p>

<p>Chapters 2-5 are an excellent summary of machine learning fundamentals, worth reading even if you're not actually interested in deep learning.</p>

</div>
<div class="bookreview textcard clearfix">
<h3><a href="http://aima.cs.berkeley.edu/">Artificial Intelligence: A Modern Approach</a> by Stuart Russell, Peter Norvig</h3>
<img src="images/bookcover_ai.jpg" class="bookcover">
<!--<img src="http://aima.cs.berkeley.edu/cover2.jpg" class="bookcover">-->
<h4>(Beginner to Advanced)</h4>

<p>The Bible of AI. There's no better book on the subject than this one.</p>
</div>

<div class="bookreview textcard clearfix">
<h3><a href="http://incompleteideas.net/book/the-book.html">Reinforcement Learning: An Introduction</a> by Richard S Sutton, Andrew G Barto</h3>
<img src="images/smallbookcover_reinforcement.gif" class="bookcover">
<!--<img src="http://incompleteideas.net/smallbookcover.gif" class="bookcover">-->
<h4>(Beginner to Advanced)</h4>

<p>An excellent, very readable and clearly written book by two authors with decades of experience in reinforcement learning research. Starts off very simply, but covers everything in detail, with plenty of examples. Includes many more esoteric topics that are not covered in Russel and Norvig's famous Artificial Intelligence textbook. I haven't read all of it yet, but I'm looking forward to it.</p>
</div>

<div class="bookreview textcard clearfix">
<h3><a href="guidetodatamining.com">A Programmer's Guide to Data Mining</a> by Ron Zacharski</h3>
<img src="images/bookcover_mozi.png" class="bookcover">
<!--<img src="http://www.guidetodatamining.com/img/mozi.png" class="bookcover">-->
<h4>(Beginner)</h4>

<p>A very basic introduction to data mining, but great fun to read, chockful of illustrations and jokes. It mostly concentrates on recommender systems and classification.</p>
</div>

<div class="bookreview textcard clearfix">
<h3><a href="https://www.abondance.com/20180222-18963-reussir-referencement-web-nouvelle-version-2018-2019.html">R&eacute;ussir son r&eacute;f&eacute;rencement web</a> by Olivier Andrieu</h3>
<img src="images/reussir-son-referencement-web-vignette.jpg" class="bookcover">
<!--<img src="https://www.abondance.com/wp-content/uploads/2018/07/reussir-son-referencement-web-vignette.jpg" class="bookcover">-->
<h4>(Beginner to Advanced)</h4>

<p>600 pages sur le r&eacute;f&eacute;rencement, &eacute;crit par le maitre francais du SEO. Il se concentre surtout sur le mode de fonctionnement Google, &eacute;tant donn&eacute; que Google fait 94 % du march&eacute; francais. Extrement d&eacute;taill&eacute;, extrement lisible. Il partage tout ce qu'il a pu deduire du mode de fonctionnement de l'algo Google pendant les 20 ann&eacute;es qu'il travaille dans le domaine. Il discute aussi des specificit&eacute;s en dehors du monde anglophone (domaine en fr ou com, sites multilingues, etc.) Une fois qu'on a lu ce livre, on ne sent meme plus le besoin de lire un autre sur le sujet.</p>

</div>



<!--
<h5>Data Mining et statistique decisionnelle</h5>

<p>Exhaustive, focus on marketing, banks</p>

<p>10000 pages tres detaillees, j'ai pas tout lu</p>-->

<div class="bookreview textcard clearfix">
<h3><a href="https://www.apress.com/us/book/9781430238195">Pro Android Web Game Apps</a> by Juriy Bura</h3>
<img src="images/bookcover_games.jpg" class="bookcover">
<!--<img src="https://images.springer.com/sgw/books/medium/9781430238195.jpg" class="bookcover">-->
<h4>(Beginner to Intermediate)</h4>

<p>Despite the word Android in the title, the Android-specific part is limited to one or two chapters at the end. It's actually a book about how to write webapps (not even necessarily games) that will run on any device with a browser, with or without a touchscreen. In other words, it's a HTML/CSS/JavaScript book with a heavy emphasis on graphics.</p>

<p>Unlike many similar books, it doesn't rely on fancy JavaScript game engines to quickly get you creating complete working games... and then leave you limited to only what that particular game engine can do. Instead, it goes through all the details of event handling, the canvas element, sprites, game maps, storing game info server-side, etc. etc. mostly in pure JS. By the time game engines are introduced, you've already learnt how to do a huge amount of stuff on your own.</p>
</div>

<div class="bookreview textcard clearfix">
<h3><a href="https://www.eyrolles.com/Informatique/Livre/data-science-fondamentaux-et-etudes-de-cas-9782212142433">Data Science : fondamentaux et &eacute;tudes de cas</a> by Eric Biernat, Michel Lutz</h3>
<img src="images/bookcover_datascience.jpg" class="bookcover">
<!--<img src="https://static.eyrolles.com/img/2/2/1/2/1/4/2/4/9782212142433_h430.jpg" class="bookcover">-->
<h4>(Beginner)</h4>

<p>Les auteurs eux-meme disent que le livre s'adresse <i>Aux d&eacute;veloppeurs, statisticiens, &eacute;tudiants et chefs de projets ayant &agrave; r&eacute;soudre des probl&egrave;mes de data science ; Aux data scientists, mais aussi &agrave; toute personne curieuse d'avoir une vue d'ensemble de l'&eacute;tat de l'art</i> et c'est plutot exacte. Il faudrait juste remplacer <i>data scientists</i> par <i>data scientists d&eacute;butants</i>.</p>

Ca commence de z&eacute;ro (que-ce que c'est le machine learning ?) et couvre tous les algos de base sans trop rentrer dans les d&eacute;tails. Vers la fin il y a quelques chapitres beaucoup plus specialis&eacute;s notamment sur l'application du ML aux s&eacute;ries temporelles, tous tir&eacute;s des exp&eacute;riences professionelles des auteurs.</p>
Tr&egrave;s bien &eacute;crit, style tr&egrave;s lisible. Probablement le meilleur livre pour d&eacute;butants en machine learning que j'ai lu quelque soit la langue.</p>
</div>

<div class="bookreview textcard clearfix">
<h3><a href="http://shop.oreilly.com/product/0636920023784.do">Python for Data Analysis</a> by Wes McKinney</h3>
<img src="images/bookcover_pandas.jpg" class="bookcover">
<!--<img src="https://covers.oreillystatic.com/images/0636920023784/lrg.jpg" class="bookcover">-->
<h4>(Beginner)</h4>

<p>Comprehensive guide to the python data analysis library pandas, written by the initial developer of pandas himself. Also a good introduction to the basic python toolkit for data analysis : ipython, matplotlib and some parts of numpy (the parts you need if you do data analysis but not applied maths), and to some of the basic ideas, e.g. data wrangling, handling time series, interacting with APIs...</p>
</div>

<div class="bookreview textcard clearfix">
<h3><a href="https://www.eyrolles.com/Informatique/Livre/techniques-de-referencement-web-9782212676075/">Techniques de r&eacute;f&eacute;rencement web</a> by Alexandra Martin, Mathieu Chartier</h3>
<img src="images/bookcover_techniques.jpg" class="bookcover">
<!--<img src="https://servimg.eyrolles.com/static/media/6075/9782212676075_internet_w290.jpg" class="bookcover">-->
<h4>(Intermediate to Advanced)</h4>

<p>Ouvrage beaucoup plus technique que la majorit&eacute; des livres sur le r&eacute;f&eacute;rencement. 540 pages avec de nombreux d&eacute;tails techniques que l'on ne trouve pas facilement ailleurs.</p>

</div> <!--content>




<div class="footer">
  <p>CSS stylesheet from W3 schools</p>
</div>

</body>
</html>
